(function () {

    var questions = [
        {
          "title": "דוגמה - מהו חיל האוויר?",
          "a": "חייל שיודע לנשום",
          "b": "זרוע האוויר והחלל של צה\"ל",
          "c": "אגודת חובבי הרחפנים בישראל",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "דוגמה - באיזה מועד היתה מלחמת יום כיפור?",
          "a": "חנוכה",
          "b": "פסח",
          "c": "יום הכיפורים",
          "correct": "ג",
          "category": "מלחמות ישראל"
        },
        {
          "title": "דוגמה - איזה מטוס הכי חדש?",
          "a": "F15",
          "b": "F16",
          "c": "F35",
          "correct": "ג",
          "category": "מטוסי קרב"
        },
        {
          "title": "דוגמה - מה מהמטוסים הבאים הוא F35?",
          "a": "אדיר",
          "b": "יסעור",
          "c": "בז",
          "correct": "א",
          "category": "מטוסי קרב"
        },
        {
          "title": "",
          "a": "",
          "b": "",
          "c": "",
          "correct": "",
          "category": ""
        },
        {
          "title": "מה תפקידה של מערכת ה\"חץ\"?",
          "a": "יירוט מטוסי אויב",
          "b": "יירוט טילים ארוכי טווח",
          "c": "יירוט טילים לטווח בינוני ארוך",
          "correct": "ב",
          "category": "הגנ\"א"
        },
        {
          "title": "מהי ארץ הייצור של מטוסי הקרב של חיל-האוויר?",
          "a": "ארה\"ב",
          "b": "צרפת",
          "c": "אנגליה",
          "correct": "א",
          "category": "מטוסי קרב"
        },
        {
          "title": "מהי המלחמה הראשונה בה השתתף מטוס ה\"ברק",
          "a": "יום כיפור",
          "b": "לבנון הראשונה",
          "c": "עצמאות",
          "correct": "ב",
          "category": "מלחמות ישראל"
        },
        {
          "title": "מהו השם העברי של מטוס-הקרב F-15I",
          "a": "אדיר",
          "b": "סופה",
          "c": "רעם",
          "correct": "ג",
          "category": "מטוסי קרב"
        },
        {
          "title": "איזה מטוס-קרב הוא הכי ותיק בחיל-האוויר?",
          "a": "בז",
          "b": "אדיר",
          "c": "רעם",
          "correct": "א",
          "category": "מטוסי קרב"
        },
        {
          "title": "איזו יחידה מיוחדת היא חלק מהחיל?",
          "a": "שלדג",
          "b": "יהל\"ם",
          "c": "מגלן",
          "correct": "א",
          "category": "יחידות מיוחדות"
        },
        {
          "title": "מתי נוסד חיל-האוויר הישראלי?",
          "a": 1950,
          "b": 1947,
          "c": 1948,
          "correct": "ג",
          "category": "כללי"
        },
        {
          "title": "אילו מן הבאים הינו מטוס הדרכה?",
          "a": "נחשון",
          "b": "עפרוני",
          "c": "ראם",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "בעבר הוא נקרא מל\"ט, אך כיום...",
          "a": "כטב\"ם",
          "b": "מזל\"ט",
          "c": "כטמ\"ם",
          "correct": "ג",
          "category": "כטמ\"ם"
        },
        {
          "title": "מהו הכטמ\"ם הגדול ביותר בחיל?",
          "a": "זיק",
          "b": "איתן",
          "c": "כוכב",
          "correct": "ב",
          "category": "כטמ\"ם"
        },
        {
          "title": "כמה טייסות \"אדיר\" יש בחיל-האוויר?",
          "a": 0,
          "b": 1,
          "c": 2,
          "correct": "ג",
          "category": "מטוסי קרב"
        },
        {
          "title": "באיזה בסיס נמצא בית הספר לטיסה?",
          "a": "חצור",
          "b": "חצרים",
          "c": "פלמחים",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "מהו שם המבצע שפתח את מלחמת ששת הימים?",
          "a": "מבצע אופרה",
          "b": "מבצע חד וחלק",
          "c": "מבצע מוקד",
          "correct": "ג",
          "category": "מלחמות ישראל"
        },
        {
          "title": "מהו מטוס התדלוק של חיל האוויר?",
          "a": "ראם",
          "b": "שמשון",
          "c": "בז",
          "correct": "א",
          "category": "תובלה"
        },
        {
          "title": "באיזו שנה הוקמה כנף הכוחות המיוחדים של חיל האוויר?",
          "a": 1975,
          "b": 2020,
          "c": 2004,
          "correct": "ב",
          "category": "יחידות מיוחדות"
        },
        {
          "title": "מהו שמו של מפקד חיל-האוויר הנוכחי?",
          "a": "אלוף עמיקם נורקין",
          "b": "אלוף אמיר אשל",
          "c": "רב-אלוף אביב כוכבי",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "איזו מערכת הגנ\"א הינה החדשה ביותר?",
          "a": "כיפת ברזל",
          "b": "קלע דוד",
          "c": "S-300",
          "correct": "ב",
          "category": "הגנ\"א"
        },
        {
          "title": "מהן ראשי התיבות של יב\"א?",
          "a": "יחידת בידוק ואיפוס",
          "b": "יחידת בקרה אזורית",
          "c": "יחידת בטחון אזורי",
          "correct": "ב",
          "category": "מערך הבקרה והפיקוח"
        },
        {
          "title": "באיזה בסיס נמצא המטה המבצעי של חיל-האוויר?",
          "a": "קריה",
          "b": "רמון",
          "c": "רמת דוד",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "מי אחראי על תא המטען במסוק?",
          "a": "פקח העמסה",
          "b": "קברניט",
          "c": "מכונאי מוטס",
          "correct": "ג",
          "category": "מסוקי סער"
        },
        {
          "title": "איזה מערך בחיל-האוויר הוא בעל מספר שעות הטיסה הרב ביותר?",
          "a": "מערך הקרב",
          "b": "מערך התובלה",
          "c": "מערך הכטמ\"ם",
          "correct": "ג",
          "category": "כללי"
        },
        {
          "title": "איזו חיה מזוהה עם יחידת העילית 669?",
          "a": "חתול",
          "b": "כלב",
          "c": "נמר",
          "correct": "א",
          "category": "יחידות מיוחדות"
        },
        {
          "title": "איזו טייסת נסגרה בשנת 2020?",
          "a": 117,
          "b": 115,
          "c": 116,
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "מהו שמו הלועזי של מסוק ה\"ינשוף\"?",
          "a": "גולדן איגל",
          "b": "בלאק-הוק",
          "c": "צ'ינוק",
          "correct": "ב",
          "category": "מסוקי סער"
        },
        {
          "title": "מהי הטייסת הראשונה של החיל?",
          "a": 101,
          "b": 100,
          "c": 210,
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "באיזו דרגה השתחרר משירות אילן רמון ז\"ל?",
          "a": "אלוף-משנה",
          "b": "תת-אלוף",
          "c": "רב-סרן",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "מהו השם הנפוץ ביותר לטייסים בחיל?",
          "a": "עידן",
          "b": "רועי",
          "c": "גיא",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "כמה זנבות יש לF-15?",
          "a": 3,
          "b": 1,
          "c": 2,
          "correct": "ג",
          "category": "מטוסי קרב"
        },
        {
          "title": "כמה זמן אורך קורס-הטיס?",
          "a": "3 שנים",
          "b": "תלוי בחניך",
          "c": "שנתיים וחצי",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "מהו השלב האחרון בקורס-הטיס?",
          "a": "יסודות",
          "b": "בסיסי",
          "c": "מתקדם",
          "correct": "ג",
          "category": "כללי"
        },
        {
          "title": "איזה מהבאים הינו מסוק קרב?",
          "a": "פתן",
          "b": "יסעור",
          "c": "ינשוף",
          "correct": "א",
          "category": "מסוקי קרב"
        },
        {
          "title": "איזה מהבאים עדיין נמצא בשירות פעיל בחיל?",
          "a": "מיראז'",
          "b": "רעם",
          "c": "סקייהוק",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "באיזה צבע הכומתה של חיל-האוויר?",
          "a": "אפור",
          "b": "כחול",
          "c": "שחור",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "באיזה צבע סרבלם של טכנאי החיל?",
          "a": "לבן",
          "b": "ירוק",
          "c": "כחול",
          "correct": "ג",
          "category": "המערך הטכני"
        },
        {
          "title": "השנה, מטוסי קרב של חיל-האוויר פרסו לראשונה ל...",
          "a": "יוון",
          "b": "גרמניה",
          "c": "צרפת",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "היכן ממוקם הבסיס הטכני של חיל-האוויר?",
          "a": "חיפה",
          "b": "ערד",
          "c": "רחובות",
          "correct": "א",
          "category": "כללי"
        },
        {
          "title": "באיזו דרגה מסיימים בוגרי קורס-הטיס?",
          "a": "סרן",
          "b": "סגן",
          "c": "סגן-משנה",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "איזו טייסת משתפת פעולה עם חיל הים?",
          "a": 193,
          "b": 101,
          "c": 133,
          "correct": "א",
          "category": "מסוקי סער"
        },
        {
          "title": "מהו הבסיס הדרומי ביותר של החיל?",
          "a": "חצרים",
          "b": "רמון",
          "c": "עובדה",
          "correct": "ג",
          "category": "כללי"
        },
        {
          "title": "מהו המסוק הותיק ביותר בחיל?",
          "a": "יסעור",
          "b": "ינשוף",
          "c": "שרף",
          "correct": "א",
          "category": "מסוקי סער"
        },
        {
          "title": "באיזו שנה התרחש קרב האוויר האחרון בחיל-האוויר?",
          "a": 1973,
          "b": 1985,
          "c": 2020,
          "correct": "ב",
          "category": "מטוסי קרב"
        },
        {
          "title": "מי היה הרמטכ\"ל הראשון יוצא חיל-האוויר?",
          "a": "חיים בר-לב",
          "b": "דן חלוץ",
          "c": "דן שומרון",
          "correct": "ב",
          "category": "כללי"
        },
        {
          "title": "מהו בסיס הטיסה הראשון של חיל-האוויר?",
          "a": "עקרון",
          "b": "שדה התעופה לוד",
          "c": "שדה דב",
          "correct": "ג",
          "category": "כללי"
        },
        {
          "title": "איך קוראים ללוחם צוות-האוויר האמון על תדלוק במטוס תובלה?",
          "a": "בומר",
          "b": "נווט",
          "c": "דלקן",
          "correct": "א",
          "category": "תובלה"
        },
        {
          "title": "באיזו מלחמה חיל-האוויר הפיל יותר מטוסי אויב?",
          "a": "מלחמת העצמאות",
          "b": "מלחמת יום הכיפורים",
          "c": "מלחמת ששת הימים",
          "correct": "ב",
          "category": "מלחמות ישראל"
        },
        {
          "title": "מה היה מטוס ההדרכה הסילוני הראשון בחיל?",
          "a": "פוגה",
          "b": "צוקית",
          "c": "לביא",
          "correct": "א",
          "category": "כללי"
        }
    ];

    var count = 0,
        maxQuestions = 5;


    // create the quiz button
    var enterQuizButton = document.createElement("div");
    enterQuizButton.classList.add('button', 'on-map', 'quiz');
    document.body.appendChild(enterQuizButton);

    // create the quiz inself

    enterQuizButton.addEventListener('click', function () {
        $('#quiz').css('display', 'block').animate({
            'opacity': 1
        }, 1000)

        questions = questions.sort(()=>Math.random()-.5);

        showNextQuestion();

    });

    function showNextQuestion() {
        var question = questions[count++];
        $('#quiz .title').text(question.title)
        $('#quiz .option.a').text(question.a)
        $('#quiz .option.b').text(question.b)
        $('#quiz .option.c').text(question.c)
        $('#quiz .counter .current').text(count)
        $('#quiz .counter .total').text(maxQuestions)
    }

    $('#quiz .option').on("click", function () {
        var question = questions[count-1];
        if(this.classList.contains(question.correct)) {
            this.classList.add('correct');
        } else {
            this.classList.add('wrong');
        }
    })

})()