{
    "25": {
    "name":"עפרוני",
        "audioSrc": "audio/efroni.mp3",
        "text": "שלום לכולם. כאן טייסי הצוות האווירובטי של חיל-האוויר. אנו גאים לקיים השנה את המטס האווירי המסורתי לרגל 75 שנות העצמאות למדינת ישראל. חג עצמאות שמח!"
    },
    "26": {
    "name":"בז",
        "audioSrc": "audio/106.mp3",
        "text": " שלום, כאן רב-סרן א', נווטת קרב מטייסת 106 \"חוד החנית\", גאה לקחת חלק במטס האוויר המסורתי לציון 75 שנות עצמאות למדינת ישראל. חיל-האוויר מאחל לכם, אזרחי המדינה, חג עצמאות שמח!"
        },
    "130": {
    "name":"עמותת אילן",
        "audioSrc": "",
        "text": "כאן סרן א'. חיל-האוויר מצדיע לחברי עמותת אילן על נתינה ומסירות עד אין קץ להפוך את החברה שלנו לטובה, מכבדת וקשובה לכלל אזרחיה. חג עצמאות שמח!"
    },
    "80": {
        "name":" מרכז קליטה הוד טבריה לעולי אתיופיה",
            "audioSrc": "audio/beitHalohem.mp3",
            "text": "כאן סרן ה', חיל-האוויר מצדיע לעולי אתיופיה במרכז הקליטה הוד בטבריה, ולכל העולם במדינת ישראל אשר עלו ארצה מתוך תחושת שליחות, ציונות ואהבת המולדת - חג עצמאות שמח!"
        },
    "95": {
        "name":"בית הלוחם תל אביב",
            "audioSrc": "audio/beitHalohem.mp3",
            "text": "כאן סרן א'. חיל-האוויר מצדיע לנושאים בגופים ובנפשם את המחיר הכבד על תקומת הארץ, ולאלה אשר שוקדים לסייע, לטפל ולתמוך בהשגת זכויותיהם. חג עצמאות שמח!"
    },
    "20": {
        "name":"בה\"ד 1",
            "audioSrc": "audio/bahad1.mp3",
            "text": "כאן סרן א', חיל-האוויר מצדיע לכלל מפקדי צה\"ל הנכנסים בשערי בה\"ד 1 ומבטיחים להוות דוגמה אישית, ולחנך דורות של משרתים לביטחון והגנת הארץ ותושביה. חג עצמאות שמח!"
    },
    "18": {
        "name":"מדרשת בן גוריון",
            "audioSrc": "",
            "text": "כאן סרן ה', חיל-האוויר מצדיע לאנשי הנגב המגשימים את חזון הפרחת השממה ופועלים מתוך שליחות וציונות. חג עצמאות שמח!"
    },
    "4": {
        "name":"מוזיאון יד מרדכי",
            "audioSrc": "audio/yadMordehai.mp4",
            "text": "כאן סרן א'. חיל-האוויר מצדיע לאנשי מוזיאון יד מרדכי וחברי הקיבוץ, על המחויבות לצו הזיכרון ולהנחלת השואה והגבורה של העם היהודי ותקומתו בארץ ישראל. חג עצמאות שמח!"
    },
    "2": {
    "name":"ינשוף",
        "audioSrc": "audio/124.mp4", 
        "text": "כאן א', ממסוק ינשוף מטייסת 124, \"החרב המתהפכת\". אנשי הטייסת, הטכנאים והלוחמים, בסדיר ובמילואים, עומדים מאחוריכם, אזרחי המדינה, ומאחלים חג עצמאות שמח!"
    }

}
